CSI API ETABS v1

# cDStItalianNTC2008SSetPreference Method

---

Sets the value of a steel design preference item.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetPreference(
    	int Item,
    	double Value
    )

    Function SetPreference (
    	Item As Integer,
    	Value As Double
    ) As Integer

    Dim instance As cDStItalianNTC2008S
    Dim Item As Integer
    Dim Value As Double
    Dim returnValue As Integer

    returnValue = instance.SetPreference(Item,
    	Value)

    int SetPreference(
    	int Item,
    	double Value
    )

    abstract SetPreference :
            Item : int *
            Value : float -> int

#### Parameters

Item

    Type: SystemInt32
This is an integer between 3 and 23, inclusive, indicating the preference item
considered.

  3. Method used for Buckling in P-M-M
  4. Framing type
  5. Partial safety factor, GammaM0
  6. Partial safety factor, GammaM1
  7. Partial safety factor, GammaM2
  8. Consider deflection
  9. DL deflection limit, L/Value
  10. SDL + LL deflection limit, L/Value
  11. LL deflection limit, L/Value
  12. Total load deflection limit, L/Value
  13. Total camber limit, L/Value
  14. Pattern live load factor
  15. Demand/capacity ratio limit
  16. Multi-response case design
  17. Behavior factor, q
  18. System overstrength, Omega
  19. Consider P-delta
  20. Consider torsion
  21. Ignore seismic code
  22. Ignore special seismic load
  23. Are Doubler plates plug-welded

Value

    Type: SystemDouble
The numeric value of the considered preference item.

  3. Method used for Buckling in P-M-M
     * 1 = Method A
     * 2 = Method B
     * 3 = Both
  4. Framing type
     * 1 = DCH-MRF
     * 2 = DCL-MRF
     * 3 = DCH-CBF
     * 4 = DCL-CBF
     * 5 = DCH-EBF
     * 6 = DCL-EBF
     * 7 = InvPendulum
     * 8 = Non Dissipative
  5. Partial safety factor, GammaM0

Value > 0

  6. Partial safety factor, GammaM1

Value > 0

  7. Partial safety factor, GammaM2

Value > 0

  8. Consider deflection

1 or "No" - Default

2 or "Yes"

  9. DL deflection limit, L/Value

Value > 0

  10. SDL + LL deflection limit, L/Value

Value > 0

  11. LL deflection limit, L/Value

Value > 0

  12. Total load deflection limit, L/Value

Value > 0

  13. Total camber limit limit, L/Value

Value > 0

  14. Pattern live load factor

Value > 0

  15. Demand/capacity ratio limit

Value > 0

  16. Multi-response case design
     * 1 = Envelopes
     * 2 = Step-by-Step
     * 3 = Last Step
     * 4 = Enveleopes -- All
     * 5 = Step-by-Step -- All
  17. Behavior factor, q

Value > 0

  18. System overstrength, Omega

Value > 0

  19. Consider P-delta

1 or "No" - Default

2 or "Yes"

  20. Consider Torsion

1 or "No" - Default

2 or "Yes"

  21. Ignore seismic code

1 or "No" - Default

2 or "Yes"

  22. Ignore special seismic load

1 or "No" - Default

2 or "Yes"

  23. Are Doubler plates plug-welded

1 or "No" - Default

2 or "Yes"

#### Return Value

Type: Int32
Returns zero if the item is successfully retrieved; otherwise it returns a
nonzero value.

Remarks

Examples

VB

Copy

    Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Value As Double
       Dim ProgDet As Boolean

    'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

    'start ETABS application
      ret = EtabsObject.ApplicationStart()

    'create SapModel object
       SapModel = EtabsObject.SapModel

    'initialize model
       ret = SapModel.InitializeNewModel()

    'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

    'set steel design code
       ret = SapModel.DesignSteel.SetCode("Italian NTC 2008")

    'set overwrite item
       ret = SapModel.DesignSteel.Italian_NTC_2008.SetPreference(2, 1)

    'close ETABS
       EtabsObject.ApplicationExit(False)

    'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing

    End Sub

See Also

#### Reference

cDStItalianNTC2008S Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com